Workspace/test_cases/Acoustic-test/3DRoomAcoustic/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
 //volVectorFieldValue U (0 0 0)
 //volScalarFieldValue T 300
 //volScalarFieldValue p 101325
 );

regions (
     sphereToCell
     {
       centre (6 3 6);
       radius .08;
       fieldValues
 (
  volScalarFieldValue p 123765
  );
     } 
);



// ************************************************************************* //
